docgalaxyblock/Mowgli-cedbossneo/stm32/ros_usbnode/src/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  Georg Swoboda <cn@warp.at>
  * @date    21/09/2022  
  * @version 1.0.0
  * @brief   main / bootup and initialization, motor control routines, usb init
  ****************************************************************************** 
  *  
  * compile with -DBOARD_YARDFORCE500 to enable the YF500 GForce pinout
  * 
  * ROS integration howto taken from here: https://github.com/Itamare4/ROS_stm32f1_rosserial_USB_VCP (Itamar Eliakim)
  * 
  ******************************************************************************
  */

#include <stdio.h>
#include <stdarg.h>
#include <math.h>
#include <string.h>
#include "stm32f1xx_hal.h"
#include "stm32f1xx_hal_uart.h"
#include "stm32f1xx_hal_adc.h"
#include "main.h"
// stm32 custom
#include "board.h"
#include "panel.h"
#include "panel.h"
#include "blademotor.h"
#include "drivemotor.h"
#include "emergency.h"
#include "soft_i2c.h"
#include "i2c.h"
#include "imu/imu.h"
#include "usb_device.h"
#include "usbd_cdc_if.h"
#include "nbt.h"

// ros
#include "cpp_main.h"
#include "ringbuffer.h"

static void WATCHDOG_Refresh(void); 

static nbt_t main_chargecontroller_nbt;
static nbt_t main_statusled_nbt;
static nbt_t main_emergency_nbt;
static nbt_t main_drivemotor_nbt;
static nbt_t main_wdg_nbt;
static nbt_t main_buzzer_nbt;
#ifdef BLADEMOTOR_USART_ENABLED
  static nbt_t main_blademotor_nbt;
#endif

// MASTER tx buffering
volatile uint8_t  master_tx_busy = 0;
static uint8_t master_tx_buffer_len;
static char master_tx_buffer[255];

typedef enum{
    CHARGER_STATE_IDLE,
    CHARGER_STATE_CONNECTED,
    CHARGER_STATE_CHARGING_CC,
    CHARGER_STATE_CHARGING_CV,
    CHARGER_STATE_END_CHARGING,
} CHARGER_STATE_e;

/* union to store a float in the U16 backup register */
union FtoU{
    float_t  f;
    uint16_t u[2];
};

int blade_motor = 0;

static uint8_t panel_rcvd_data;
volatile float batteryVoltage,current,chargerVoltage,chargerInputVoltage,input_PC3;

union FtoU ampere_acc;
union FtoU charge_current_offset;
uint8_t do_chirp_duration_counter;
uint8_t do_chirp = 0;

// exported via rostopics
float_t SOC = 0;
float_t battery_voltage;
float_t charge_voltage;
float_t charge_current;
float_t blade_temperature;
uint16_t chargecontrol_pwm_val = MIN_CHARGE_PWM;
uint8_t  chargecontrol_is_charging = 0;


UART_HandleTypeDef MASTER_USART_Handler; // UART  Handle
/*
UART_HandleTypeDef DRIVEMOTORS_USART_Handler; // UART  Handle
UART_HandleTypeDef BLADEMOTOR_USART_Handler; // UART  Handle
*/

// SPI3 FLASH
SPI_HandleTypeDef SPI3_Handle;

// Drive Motors DMA
DMA_HandleTypeDef hdma_usart2_rx;
DMA_HandleTypeDef hdma_usart2_tx;
DMA_HandleTypeDef hdma_uart4_rx;
DMA_HandleTypeDef hdma_uart4_tx;

/*ADC variables */
ADC_HandleTypeDef ADC2_Handle;

typedef enum{
    ADC2_CHANNEL_CURRENT = 0,
    ADC2_CHANNEL_CHARGEVOLTAGE,
    ADC2_CHANNEL_BATTERYVOLTAGE,
    ADC2_CHANNEL_CHARGERINPUTVOLTAGE,
    ADC2_CHANNEL_PC2,
    ADC2_CHANNEL_MAX,
} ADC2_channelSelection_e;
ADC2_channelSelection_e adc2_eChannelSelection = ADC2_CHANNEL_CURRENT;
void adc2_SetChannel(ADC2_channelSelection_e channel);
void ADC2_Init();
TIM_HandleTypeDef TIM1_Handle;  // PWM Charge Controller
TIM_HandleTypeDef TIM2_Handle;  // Time Base for ADC
TIM_HandleTypeDef TIM3_Handle;  // PWM Beeper
IWDG_HandleTypeDef IwdgHandle = {0};
WWDG_HandleTypeDef WwdgHandle = {0};

RTC_HandleTypeDef hrtc = {0};

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
   // do nothing here
}

/*
 * called when DMA transfer completes
 * update <xxxx>_tx_busy to let XXXX_Transmit function now when the DMA buffer is free 
 */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{   
    if (huart->Instance == MASTER_USART_INSTANCE)
    {
        if (__HAL_USART_GET_FLAG(&MASTER_USART_Handler, USART_FLAG_TC))        
        {
            master_tx_busy = 0;
        }
    }
}

void HAL_UART_TxHalfCpltCallback(UART_HandleTypeDef *huart)
{
   // do nothing here
}

/*
 * Master UART receive ISR
 * DriveMotors UART receive ISR
 * PANEL UART receive ISR
 */ 
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{                  
       if (huart->Instance == DRIVEMOTORS_USART_INSTANCE)
       {
            DRIVEMOTOR_ReceiveIT();
       }       
       else if(huart->Instance == PANEL_USART_INSTANCE)
       {
           PANEL_Handle_Received_Data(panel_rcvd_data);
           HAL_UART_Receive_IT(&PANEL_USART_Handler, &panel_rcvd_data, 1);   // rearm interrupt               
       }
#ifdef BLADEMOTOR_USART_ENABLED
       else if(huart->Instance == BLADEMOTOR_USART_INSTANCE)
       {
            BLADEMOTOR_ReceiveIT();
       }
#endif       
}

int main(void)
{    
    HAL_Init();
    SystemClock_Config();

    __HAL_RCC_AFIO_CLK_ENABLE();    
    __HAL_RCC_PWR_CLK_ENABLE();

    MX_DMA_Init();
    
    MASTER_USART_Init();

    debug_printf("\r\n");
    debug_printf("    __  ___                    ___\r\n");
    debug_printf("   /  |/  /___ _      ______ _/ (_)\r\n");
    debug_printf("  / /|_/ / __ \\ | /| / / __ `/ / / \r\n");
    debug_printf(" / /  / / /_/ / |/ |/ / /_/ / / /  \r\n");
    debug_printf("/_/  /_/\\____/|__/|__/\\__, /_/_/   \r\n");
    debug_printf("                     /____/        \r\n");
    debug_printf(" Version: %d.%d.%d\r\n", MOWGLI_SW_VERSION_MAJOR, MOWGLI_SW_VERSION_BRANCH, MOWGLI_SW_VERSION_MINOR);
    debug_printf("\r\n\r\n");
    debug_printf(" * Master USART (debug) initialized\r\n");
    LED_Init();
    debug_printf(" * LED initialized\r\n");
    TIM2_Init();
    ADC2_Init();
    TIM3_Init();
    HAL_TIM_PWM_Start(&TIM3_Handle, TIM_CHANNEL_4);    
    debug_printf(" * Timer3 (Beeper) initialized\r\n");
    TF4_Init();
    debug_printf(" * 24V switched on\r\n");
    RAIN_Sensor_Init();
    debug_printf(" * RAIN Sensor enable\r\n");

    I2C_Init();
    debug_printf(" * Hard I2C initialized\r\n");
    if (I2C_Acclerometer_TestDevice())
    {
         I2C_Accelerometer_Setup();          
    }
    else
    {
        chirp(3);        
        debug_printf(" * WARNING: initalization of onboard accelerometer for tilt protection failed !\r\n");
    }    
    debug_printf(" * Accelerometer (onboard/tilt safety) initialized\r\n");    
    SW_I2C_Init();
    debug_printf(" * Soft I2C (J18) initialized\r\n");
#ifdef HAS_EXT_IMU    
    debug_printf(" * Testing supported external IMUs:\r\n");
    IMU_TestDevice();
    IMU_Init();
    IMU_CalibrateExternal();
#else
    debug_printf(" * External IMU not enabled !\r\n");
#endif
    debug_printf(" * Onboard IMU:\r\n");
    IMU_CalibrateOnboard();    
    Emergency_Init();
    debug_printf(" * Emergency sensors initialized\r\n");
    TIM1_Init();   
    debug_printf(" * Timer1 (Charge PWM) initialized\r\n");    
    MX_USB_DEVICE_Init();
    debug_printf(" * USB CDC initialized\r\n");
    PANEL_Init();
    debug_printf(" * Panel initialized\r\n");

    // Charge CH1/CH1N PWM Timer
    HAL_TIM_PWM_Start(&TIM1_Handle, TIM_CHANNEL_1);
    HAL_TIMEx_PWMN_Start(&TIM1_Handle, TIM_CHANNEL_1);
    debug_printf(" * Charge Controler PWM Timers initialized\r\n");
    
    // Init Drive Motors and Blade Motor
    #ifdef DRIVEMOTORS_USART_ENABLED
        DRIVEMOTOR_Init();
        debug_printf(" * Drive Motors USART initialized\r\n");        
    #endif
    #ifdef BLADEMOTOR_USART_ENABLED
        BLADEMOTOR_Init();
        debug_printf(" * Blade Motor USART initialized\r\n");
    #endif
    

    HAL_UART_Receive_IT(&PANEL_USART_Handler, &panel_rcvd_data, 1);   // rearm interrupt               
    debug_printf(" * Panel Interrupt enabled\r\n");

    HAL_GPIO_WritePin(LED_GPIO_PORT, LED_PIN, 0);
    HAL_GPIO_WritePin(TF4_GPIO_PORT, TF4_PIN, 1);                       // turn on 28V supply



    // Initialize Main Timers
	  NBT_init(&main_chargecontroller_nbt, 10);
    NBT_init(&main_statusled_nbt, 1000);
	  NBT_init(&main_emergency_nbt, 10);
#ifdef BLADEMOTOR_USART_ENABLED    
    NBT_init(&main_blademotor_nbt, 100);
#endif    
    NBT_init(&main_drivemotor_nbt, 10);
    NBT_init(&main_wdg_nbt,10);
    NBT_init(&main_buzzer_nbt,200);
    debug_printf(" * NBT Main timers initialized\r\n");     

 #ifdef I_DONT_NEED_MY_FINGERS
    debug_printf("\r\n");
    debug_printf("=========================================================\r\n");
    debug_printf(" EMERGENCY/SAFETY FEATURES ARE DISABLED IN board.h ! \r\n");
    debug_printf("=========================================================\r\n");
    debug_printf("\r\n");
 #endif
    // Initialize ROS
    init_ROS();
    debug_printf(" * ROS serial node initialized\r\n");     
    debug_printf("\r\n >>> entering main loop ...\r\n\r\n"); 
    // <chirp><chirp> means we are in the main loop 
    chirp(2);    
    while (1)
    {        
        chatter_handler();
        motors_handler();    
        panel_handler();
        spinOnce();                                   
        broadcast_handler();   
        DRIVEMOTOR_App_Rx();

        if (NBT_handler(&main_chargecontroller_nbt))
        {            
            ChargeController();
        }
        if (NBT_handler(&main_statusled_nbt))
        {            
            StatusLEDUpdate();                                 
              // debug_printf("master_rx_STATUS: %d  drivemotors_rx_buf_idx: %d  cnt_usart2_overrun: %x\r\n", master_rx_STATUS, drivemotors_rx_buf_idx, cnt_usart2_overrun);           
        }
        if (NBT_handler(&main_wdg_nbt))
        {            
            WATCHDOG_Refresh();                   
        }
        if (NBT_handler(&main_drivemotor_nbt))
        {            
            DRIVEMOTOR_App_10ms();      
        }
#ifdef BLADEMOTOR_USART_ENABLED        
        if (NBT_handler(&main_blademotor_nbt))
        {            
        float f_tmp;
        const float f_RTO = 10000;
        const float beta = 3380;
        uint32_t currentTick;
        static uint32_t old_tick;

