docgalaxyblock/Mowgli-cedbossneo/stm32/ros_usbnode/src/main.c
        chargecontrol_pwm_val = 0;

        break;


    case CHARGER_STATE_IDLE:
    default:

        if (chargerInputVoltage >= 30.0 ) {
            charger_state = CHARGER_STATE_CONNECTED;
            HAL_GPIO_WritePin(TF4_GPIO_PORT, TF4_PIN, 0); /* Power off the battery  Powerbus */
            timestamp = HAL_GetTick();
             }
        chargecontrol_pwm_val = 0;
        break;
    }

    ampere_acc.f += ((current - charge_current_offset.f)/(100*60*60));
    if(ampere_acc.f >= 2.8)ampere_acc.f = 2.8;
    SOC = ampere_acc.f/2.8;

    // Writes a data in a RTC Backup data Register 1
    HAL_PWR_EnableBkUpAccess();
    HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR1, ampere_acc.u[0]);
    HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR2, ampere_acc.u[1]);
    HAL_PWR_DisableBkUpAccess();

    chargecontrol_is_charging = charger_state;

    /*Check the PWM value for safety */
    if (chargecontrol_pwm_val > 1350){
        chargecontrol_pwm_val = 1350;
        }
        TIM1->CCR1 = chargecontrol_pwm_val;  
}

/*
 * Update the states for the Emergency, Charge and Low Bat LEDs
 */
void StatusLEDUpdate(void)
{
        if (Emergency_State()) {
            debug_printf("Emergency !");
            PANEL_Set_LED(PANEL_LED_LIFTED, PANEL_LED_FLASH_FAST);
        } else {
            PANEL_Set_LED(PANEL_LED_LIFTED, PANEL_LED_OFF);
        }

        if (chargecontrol_is_charging == 1) //Connected to charger
        {
            PANEL_Set_LED(PANEL_LED_CHARGING, PANEL_LED_ON);
        }
        else if (chargecontrol_is_charging == 2) //CC mode 1A
        {
            PANEL_Set_LED(PANEL_LED_CHARGING, PANEL_LED_FLASH_FAST);
        }
        else if(chargecontrol_is_charging == 3) //CV mode
        {
            PANEL_Set_LED(PANEL_LED_CHARGING, PANEL_LED_FLASH_SLOW);
        }
        else{
            PANEL_Set_LED(PANEL_LED_CHARGING, PANEL_LED_OFF);
        }
            
        // show a lowbat warning if battery voltage drops below LOW_BAT_THRESHOLD ? (random guess, needs more testing or a compare to the stock firmware)            
        if (battery_voltage <= LOW_CRI_THRESHOLD)
        {
            PANEL_Set_LED(PANEL_LED_BATTERY_LOW, PANEL_LED_FLASH_FAST); // low
        }
        else if (battery_voltage <= LOW_BAT_THRESHOLD)
        {
            PANEL_Set_LED(PANEL_LED_BATTERY_LOW, PANEL_LED_FLASH_SLOW); // really low
        }
        else
        {
            PANEL_Set_LED(PANEL_LED_BATTERY_LOW, PANEL_LED_OFF); // bat ok
        }                

        HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_PIN);         // flash LED
}


/*
 * print hex bytes
 */
void msgPrint(uint8_t *msg, uint8_t msg_len)
{
     int i;
     debug_printf("msg: ");
     for (i=0;i<msg_len;i++)
     {
        debug_printf(" %02x", msg[i]);
     }            
     debug_printf("\r\n");
}

/*
 * calc crc byte
 */
uint8_t crcCalc(uint8_t *msg, uint8_t msg_len)
{
    uint8_t crc = 0x0;
    uint8_t i;

    for (i=0;i<msg_len;i++)
    {
        crc += msg[i];
    }
    return(crc);
}

/*
 * 2khz chirps
 */
void chirp(uint8_t count)
{    
    uint8_t i;

    for (i=0;i<count;i++)
    {
        TIM3_Handle.Instance->CCR4 = 10;   
        HAL_Delay(100);
        TIM3_Handle.Instance->CCR4 = 0;  
        HAL_Delay(50);
    }
}

/*
 * Debug print via MASTER USART
 */
void vprint(const char *fmt, va_list argp)
{
    char string[200];    
    if(0 < vsprintf(string,fmt,argp)) // build string
    {
        MASTER_Transmit((unsigned char*)string, strlen(string));       
    }
}

/*
 * Debug print
 */
void debug_printf(const char *fmt, ...) 
{
    va_list argp;
    va_start(argp, fmt);
    vprint(fmt, argp);
    va_end(argp);
}

/*
 * Send message via MASTER USART (DMA Normal Mode)
 */
void MASTER_Transmit(uint8_t *buffer, uint8_t len)
{    
    // wait until tx buffers are free (send complete)
    while (master_tx_busy) {  }
    master_tx_busy = 1;  
    // copy into our master_tx_buffer 
    master_tx_buffer_len = len;
    memcpy(master_tx_buffer, buffer, master_tx_buffer_len);
    HAL_UART_Transmit_DMA(&MASTER_USART_Handler, (uint8_t*)master_tx_buffer, master_tx_buffer_len); // send message via UART       
}

/*
 * Feed the watchdog every 10ms
 */
static void WATCHDOG_Refresh(void){
  /* Update WWDG counter */
  WwdgHandle.Instance = WWDG;
  if( HAL_WWDG_Refresh(&WwdgHandle) != HAL_OK )
  {
    #ifdef DB_ACTIVE
      DB_TRACE(" WWDG refresh error\n\r");
    #endif  /* DB_ACTIVE */

  }

  /* Reload IWDG counter */
  IwdgHandle.Instance = IWDG;
  if( HAL_IWDG_Refresh(&IwdgHandle) != HAL_OK )
  {
    #ifdef DB_ACTIVE
      DB_TRACE(" IWDG refresh error\n\r");
    #endif  /* DB_ACTIVE */
  }
}


void HAL_ADC_ConvCpltCallback (ADC_HandleTypeDef* hadc){

  if(hadc == &ADC2_Handle){
    uint16_t l_u16Rawdata = ADC2_Handle.Instance->DR;
    float tmp;

    switch (adc2_eChannelSelection)
    {
    case ADC2_CHANNEL_CURRENT:
      tmp = (((float)l_u16Rawdata/4095.0f)*3.3f - 2.5f) * 100/12.0;
      current = 0.8*tmp+0.2*current;
      break;

    case ADC2_CHANNEL_CHARGEVOLTAGE:
      tmp = ((float)l_u16Rawdata/4095.0f)*3.3f*16;
      chargerVoltage = 0.8*tmp+0.2*chargerVoltage;
      break;
    
    case ADC2_CHANNEL_BATTERYVOLTAGE:
      tmp = ((float)l_u16Rawdata/4095.0f)*3.3f*10.09 + 0.6f;
      batteryVoltage = 0.4*tmp+0.6*batteryVoltage;
      break;

    case ADC2_CHANNEL_CHARGERINPUTVOLTAGE:
      tmp = (l_u16Rawdata/4095.0f)*3.3f * (32/2);
      chargerInputVoltage = 0.5*tmp+0.5*chargerInputVoltage;
      break;

    case ADC2_CHANNEL_PC2:
      tmp = (l_u16Rawdata/4095.0f)*3.3f;
      input_PC3 = 0.5*tmp+0.5*input_PC3;
      break;

    case ADC2_CHANNEL_MAX:
    default:
      /* should not get here */
      tmp = ((float)l_u16Rawdata/4095.0f)*3.3f*10.09 + 0.6f;
      batteryVoltage = 0.1*tmp+0.9*batteryVoltage;
      break;
  }

  adc2_eChannelSelection++;
  if(adc2_eChannelSelection == ADC2_CHANNEL_MAX)adc2_eChannelSelection = ADC2_CHANNEL_CURRENT;
  adc2_SetChannel(adc2_eChannelSelection);

  HAL_ADC_Start_IT(&ADC2_Handle);
  }

}